/**
 * IP是用来【寻找网络设备的】
 * 
 * IP也称为IP地址，本身是一个数字标识。
 * 例如： 192.168.1.3
 * 这是由一个32bit的二进制数转换成十进制数得来的
 * 11000000 10101000 00000001 00000011
 * 192       168       1        3
 * 
 * IP的作用：
 * IP用来标识网络中的设备，实现设备间的通信
 * 
 * IP的分类：
 * 本地回环IP地址       -->   127.0.0.1 ~ 127.255.255.254
 * 局域网IP（私网IP）   -->   192.168.0.0 ~ 192.168.255.255
 *                           172.16.0.0 ~ 172.31.255.255
 *                           10.0.0.0 ~ 10.255.255.255
 * 广域网IP（公网IP）   -->   除上述之外的所有
 * 
 * 查询IP标准分类的网址：
 * https://zhuanlan.zhihu.com/p/193729352
 * 
 */